## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # helm_release.cert-manager will be created
+   resource "helm_release" "cert-manager" {
+       atomic                     = false
+       chart                      = "cert-manager"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "cert-manager"
+       namespace                  = "kube-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://charts.jetstack.io"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 120
+       verify                     = false
+       version                    = "v1.9.1"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "createCustomResource"
+           value = "true"
        }
+       set {
+           name  = "installCRDs"
+           value = "true"
        }
    }

  # helm_release.istio-csr will be destroyed
  # (because helm_release.istio-csr is not in configuration)
-   resource "helm_release" "istio-csr" {
-       atomic                     = false -> null
-       chart                      = "cert-manager-istio-csr" -> null
-       cleanup_on_fail            = true -> null
-       create_namespace           = false -> null
-       dependency_update          = false -> null
-       disable_crd_hooks          = false -> null
-       disable_openapi_validation = false -> null
-       disable_webhooks           = false -> null
-       force_update               = true -> null
-       id                         = "istio-csr" -> null
-       lint                       = false -> null
-       max_history                = 0 -> null
-       metadata                   = [
-           {
-               app_version = "v0.5.0"
-               chart       = "cert-manager-istio-csr"
-               name        = "istio-csr"
-               namespace   = "istio-system"
-               revision    = 1
-               values      = "null"
-               version     = "v0.5.0"
            },
        ] -> null
-       name                       = "istio-csr" -> null
-       namespace                  = "istio-system" -> null
-       pass_credentials           = false -> null
-       recreate_pods              = false -> null
-       render_subchart_notes      = true -> null
-       replace                    = false -> null
-       repository                 = "https://charts.jetstack.io" -> null
-       reset_values               = false -> null
-       reuse_values               = false -> null
-       skip_crds                  = false -> null
-       status                     = "failed" -> null
-       timeout                    = 300 -> null
-       verify                     = false -> null
-       version                    = "v0.5.0" -> null
-       wait                       = true -> null
-       wait_for_jobs              = false -> null
    }

  # kubernetes_ingress_v1.argocd_ingress will be destroyed
  # (because kubernetes_ingress_v1.argocd_ingress is not in configuration)
-   resource "kubernetes_ingress_v1" "argocd_ingress" {
-       id     = "argocd/argocd-ingress" -> null
-       status = [
-           {
-               load_balancer = [
-                   {
-                       ingress = []
                    },
                ]
            },
        ] -> null

-       metadata {
-           annotations      = {
-               "kubernetes.io/ingress.class" = "nginx"
            } -> null
-           generation       = 8 -> null
-           labels           = {} -> null
-           name             = "argocd-ingress" -> null
-           namespace        = "argocd" -> null
-           resource_version = "136354" -> null
-           uid              = "b3be8d7d-cb2e-4eb4-a1dc-a5420c7d6e04" -> null
        }

-       spec {
-           ingress_class_name = "nginx" -> null

-           default_backend {

-               service {
-                   name = "argocd-argo-cd-server" -> null

-                   port {
-                       number = 80 -> null
                    }
                }
            }

-           rule {
-               host = "argocd.wayofthesys.org" -> null

-               http {
-                   path {
-                       path      = "/*" -> null
-                       path_type = "ImplementationSpecific" -> null

-                       backend {

-                           service {
-                               name = "argocd-argo-cd-server" -> null

-                               port {
-                                   number = 80 -> null
                                }
                            }
                        }
                    }
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 2 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
